app/Controllers/Pembayaran.php

SELECT *
FROM `user`
WHERE `user`.`user_id` = '5'
SELECT *
FROM `produk`
WHERE `produk`.`id_produk` = '1'
---
    public function simpanpembayaran()
    {
        $model = new PembayaranModel();
        $userModel = new UserModel();
        $produkModel = new ProdukModel(); // Tambahkan model produk

        $user_id = $this->request->getPost('user_id');
        $id_produk = $this->request->getPost('id_produk');


        // Ambil data user
        $user = $userModel->find($user_id);
        if (!$user) {
            return redirect()->back()->with('error', 'User tidak ditemukan.');
        }

        // Ambil data produk
        $produk = $produkModel->find($id_produk);

SELECT *
FROM `user`
WHERE `user`.`user_id` = '1'
SELECT *
FROM `produk`
WHERE `produk`.`id_produk` = '1'
---
    public function proses($id_produk)
    {
        $session = session();
        $user_id = $session->get('user_id');
        if (!$user_id) {
            return redirect()->to('/login');
        }

        $userModel = new UserModel();
        $produkModel = new ProdukModel();

        $user = $userModel->find($user_id);
        $produk = $produkModel->find($id_produk);

SELECT *
FROM `produk`
WHERE `produk`.`id_produk` = '1'
---
    public function instruksi($id)
    {
        $session = session();
        $userId = $session->get('user_id'); // asumsikan ini ID user login
        $userRole = $session->get('role');

        $pembayaranModel = new PembayaranModel();
        $produkModel = new ProdukModel();

        $pembayaran = $pembayaranModel->find($id);

        if (!$pembayaran) {
            return redirect()->to('/courses')->with('error', 'Data pembayaran tidak ditemukan.');
        }

        // Jika bukan admin dan bukan pemilik pembayaran, tolak akses
        if ($userRole !== 'Admin' && $pembayaran['user_id'] != $userId) {
            return redirect()->to(base_url())->with('error', 'Anda tidak berhak mengakses halaman ini.');
        }

        $produk = $produkModel->find($pembayaran['id_produk']);